---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedToBecomeNonParametric
source: html/92df622b-fb0d-6b24-ef04-bfc8b30896b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedToBecomeNonParametric Property

Family failed to become non-parametric!

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToBecomeNonParametric { get; }
```